# CircleCircleInters

## Description
Finds the intersection of two circles.

```pascal
FUNCTION CircleCircleInters(
				cenPt1  : VECTOR;
				cenPt2  : VECTOR;
				radius1 : REAL;
				radius2 : REAL;
				VAR pt1 : VECTOR;
				VAR pt2 : VECTOR): BOOLEAN;
```

```python
def vs.CircleCircleInters(cenPt1, cenPt2, radius1, radius2):
    return (BOOLEAN, pt1, pt2)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|cenPt1|VECTOR|   |
|cenPt2|VECTOR|   |
|radius1|REAL|   |
|radius2|REAL|   |
|pt1|VECTOR|   |
|pt2|VECTOR|   |

## Version
Availability: from Vectorworks 2014

## Category
* Graphic Calculation